app/controllers/users_controller.rb

 def create
  @user = User.new(params[:user])
   if @user.save
---
INSERT INTO "users" ("auth_token", "created_at", "email", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)